results/fabio-512-run03/003_fio/artifacts/fio-output_512_128_libaio-bdev_aio_0.txt
libaio-bdev_aio: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk_bdev, iodepth=128
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666794391,
  "timestamp_ms" : 1666794391303,
  "time" : "Wed Oct 26 16:26:31 2022",
  "jobs" : [
    {
      "jobname" : "libaio-bdev_aio",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "libaio-bdev_aio",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "128",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_aio_foo.conf",
        "filename" : "Nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1742309376,
        "io_kbytes" : 1701474,
        "bw_bytes" : 248865787,
        "bw" : 243032,
        "iops" : 486047.993144,
        "runtime" : 7001,
        "total_ios" : 3402822,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1633,
          "max" : 62247,
          "mean" : 1811.110989,
          "stddev" : 139.996984,
          "N" : 3402823
        },
        "clat_ns" : {
          "min" : 4979,
          "max" : 325340,
          "mean" : 132427.546174,
          "stddev" : 71896.572287,
          "N" : 3402948,
          "percentile" : {
            "1.000000" : 10432,
            "5.000000" : 20352,
            "10.000000" : 33536,
            "20.000000" : 58112,
            "30.000000" : 82432,
            "40.000000" : 107008,
            "50.000000" : 132096,
            "60.000000" : 156672,
            "70.000000" : 181248,
            "80.000000" : 205824,
            "90.000000" : 230400,
            "95.000000" : 244736,
            "99.000000" : 261120,
            "99.500000" : 268288,
            "99.900000" : 272384,
            "99.950000" : 272384,
            "99.990000" : 276480
          }
        },
        "lat_ns" : {
          "min" : 6873,
          "max" : 327134,
          "mean" : 134238.656666,
          "stddev" : 71898.800359,
          "N" : 3402948
        },
        "bw_min" : 242081,
        "bw_max" : 243997,
        "bw_agg" : 100.000000,
        "bw_mean" : 243152.642857,
        "bw_dev" : 539.258267,
        "bw_samples" : 14,
        "iops_min" : 484162,
        "iops_max" : 487994,
        "iops_mean" : 486305.285714,
        "iops_stddev" : 1078.516533,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 35.871429,
      "sys_cpu" : 64.100000,
      "ctx" : 23,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.122398,
        "4" : 2.952990,
        "8" : 6.178166,
        "16" : 12.776160,
        "32" : 25.699023,
        ">=64" : 52.271262
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.202172,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.100000,
        "64" : 0.100000,
        ">=64" : 0.797711
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.848208,
        "20" : 3.770312,
        "50" : 12.229673,
        "100" : 20.087474,
        "250" : 59.802070,
        "500" : 3.265966,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

libaio-bdev_aio: (groupid=0, jobs=1): err= 0: pid=16486: Wed Oct 26 16:26:31 2022
  read: IOPS=486k, BW=237MiB/s (249MB/s)(1662MiB/7001msec)
    slat (nsec): min=1633, max=62247, avg=1811.11, stdev=140.00
    clat (usec): min=4, max=325, avg=132.43, stdev=71.90
     lat (usec): min=6, max=327, avg=134.24, stdev=71.90
    clat percentiles (usec):
     |  1.00th=[   11],  5.00th=[   21], 10.00th=[   34], 20.00th=[   59],
     | 30.00th=[   83], 40.00th=[  108], 50.00th=[  133], 60.00th=[  157],
     | 70.00th=[  182], 80.00th=[  206], 90.00th=[  231], 95.00th=[  245],
     | 99.00th=[  262], 99.50th=[  269], 99.90th=[  273], 99.95th=[  273],
     | 99.99th=[  277]
   bw (  KiB/s): min=242081, max=243997, per=100.00%, avg=243152.64, stdev=539.26, samples=14
   iops        : min=484162, max=487994, avg=486305.29, stdev=1078.52, samples=14
  lat (usec)   : 10=0.85%, 20=3.77%, 50=12.23%, 100=20.09%, 250=59.80%
  lat (usec)   : 500=3.27%
  cpu          : usr=35.87%, sys=64.10%, ctx=23, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.1%, 4=3.0%, 8=6.2%, 16=12.8%, 32=25.7%, >=64=52.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.1%, >=64=0.8%
     issued rwts: total=3402822,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=237MiB/s (249MB/s), 237MiB/s-237MiB/s (249MB/s-249MB/s), io=1662MiB (1742MB), run=7001-7001msec